Revit 2027 API
Transform2D.GetInverse Method
 Gets the inverse transformation of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Transform2D GetInverse()
Public Function GetInverse As Transform2D
public:
Transform2D^ GetInverse()
member GetInverse : unit -> Transform2D
Return Value
Transform2D
Exceptions
Exception | Condition
InvalidOperationException |  This transformation is not conformal or invertible.
Remarks
 The transformation matrix A is invertible if there exists a transformation matrix B such that A*B = B*A = I (identity).
See Also
Reference
Transform2D Class
Autodesk.Revit.DB Namespace